{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "bidirectional_lstm_discriminator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bilstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "bilstm_2", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_1", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "MinibatchDiscrimination", "config": {"name": "minibatch_discrimination", "trainable": true, "dtype": "float32", "units": 10, "row_size": 3}, "name": "minibatch_discrimination", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["minibatch_discrimination", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["soft_binary_accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.5, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "bidirectional/forward_bilstm_1/lstm_cell_1/kernel", "shape": [3, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_bilstm_1/lstm_cell_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_bilstm_1/lstm_cell_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional/backward_bilstm_1/lstm_cell_2/kernel", "shape": [3, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_bilstm_1/lstm_cell_2/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_bilstm_1/lstm_cell_2/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_bilstm_2/lstm_cell_4/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_1/forward_bilstm_2/lstm_cell_4/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_1/forward_bilstm_2/lstm_cell_4/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_1/backward_bilstm_2/lstm_cell_5/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_1/backward_bilstm_2/lstm_cell_5/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_1/backward_bilstm_2/lstm_cell_5/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [266, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}, {"name": "minibatch_discrimination/Variable", "shape": [10, 256, 3], "dtype": "float32"}]}]}