{"weightsManifest": [{"weights": [{"shape": [2, 1000], "name": "dense_12/kernel", "dtype": "float32"}, {"shape": [1000], "name": "dense_12/bias", "dtype": "float32"}, {"shape": [1000, 200], "name": "dense_13/kernel", "dtype": "float32"}, {"shape": [200], "name": "dense_13/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0", "generatedBy": "keras v2.4.0", "modelTopology": {"keras_version": "2.4.0", "training_config": {"metrics": ["mean_squared_error", "accuracy"], "loss_weights": null, "weighted_metrics": null, "loss": "mean_squared_error", "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false, "learning_rate": 0.10000000149011612, "name": "Adam", "beta_1": 0.8999999761581421}}}, "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"name": "dense_12_input", "sparse": false, "batch_input_shape": [null, 2], "ragged": false, "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 1000, "kernel_regularizer": null, "name": "dense_12", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "batch_input_shape": [null, 2], "trainable": true, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"units": 200, "kernel_regularizer": null, "name": "dense_13", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "trainable": true, "activation": "linear", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Reshape", "config": {"target_shape": [100, 2], "name": "reshape_6", "trainable": true, "dtype": "float32"}}], "name": "sequential_7"}}}}