{
  "format": "layers-model",
  "modelTopology": {
    "model_config": {
      "config": {
        "output_layers": [["lstm_out", 0, 0]],
        "input_layers": [["input_5", 0, 0]],
        "name": "bilstm_generator",
        "layers": [
          {
            "config": {
              "ragged": false,
              "name": "input_5",
              "batch_input_shape": [null, 100, 100],
              "dtype": "float32",
              "sparse": false
            },
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "name": "input_5"
          },
          {
            "config": {
              "trainable": true,
              "layer": {
                "config": {
                  "activation": "tanh",
                  "return_sequences": true,
                  "recurrent_initializer": {
                    "config": { "seed": null, "gain": 1.0 },
                    "class_name": "Orthogonal"
                  },
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "recurrent_constraint": null,
                  "recurrent_regularizer": null,
                  "stateful": false,
                  "implementation": 2,
                  "go_backwards": false,
                  "name": "bilstm_1",
                  "unroll": false,
                  "bias_initializer": { "config": {}, "class_name": "Zeros" },
                  "kernel_regularizer": null,
                  "trainable": true,
                  "dtype": "float32",
                  "units": 256,
                  "bias_constraint": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "kernel_constraint": null,
                  "return_state": false,
                  "kernel_initializer": {
                    "config": { "seed": null },
                    "class_name": "GlorotUniform"
                  },
                  "unit_forget_bias": true,
                  "time_major": false
                },
                "class_name": "LSTM"
              },
              "dtype": "float32",
              "name": "bidirectional_6",
              "merge_mode": "concat"
            },
            "class_name": "Bidirectional",
            "inbound_nodes": [[["input_5", 0, 0, {}]]],
            "name": "bidirectional_6"
          },
          {
            "config": {
              "trainable": true,
              "layer": {
                "config": {
                  "activation": "tanh",
                  "return_sequences": true,
                  "recurrent_initializer": {
                    "config": { "seed": null, "gain": 1.0 },
                    "class_name": "Orthogonal"
                  },
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "recurrent_constraint": null,
                  "recurrent_regularizer": null,
                  "stateful": false,
                  "implementation": 2,
                  "go_backwards": false,
                  "name": "bilstm_2",
                  "unroll": false,
                  "bias_initializer": { "config": {}, "class_name": "Zeros" },
                  "kernel_regularizer": null,
                  "trainable": true,
                  "dtype": "float32",
                  "units": 128,
                  "bias_constraint": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "kernel_constraint": null,
                  "return_state": false,
                  "kernel_initializer": {
                    "config": { "seed": null },
                    "class_name": "GlorotUniform"
                  },
                  "unit_forget_bias": true,
                  "time_major": false
                },
                "class_name": "LSTM"
              },
              "dtype": "float32",
              "name": "bidirectional_7",
              "merge_mode": "concat"
            },
            "class_name": "Bidirectional",
            "inbound_nodes": [[["bidirectional_6", 0, 0, {}]]],
            "name": "bidirectional_7"
          },
          {
            "config": {
              "activation": "tanh",
              "return_sequences": true,
              "recurrent_initializer": {
                "config": { "seed": null, "gain": 1.0 },
                "class_name": "Orthogonal"
              },
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "recurrent_constraint": null,
              "recurrent_regularizer": null,
              "stateful": false,
              "implementation": 2,
              "go_backwards": false,
              "name": "lstm_out",
              "unroll": false,
              "bias_initializer": { "config": {}, "class_name": "Zeros" },
              "kernel_regularizer": null,
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "bias_constraint": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "kernel_constraint": null,
              "return_state": false,
              "kernel_initializer": {
                "config": { "seed": null },
                "class_name": "GlorotUniform"
              },
              "unit_forget_bias": true,
              "time_major": false
            },
            "class_name": "LSTM",
            "inbound_nodes": [[["bidirectional_7", 0, 0, {}]]],
            "name": "lstm_out"
          }
        ]
      },
      "class_name": "Model"
    },
    "backend": "tensorflow",
    "keras_version": "2.4.0"
  },
  "weightsManifest": [
    {
      "weights": [
        {
          "shape": [100, 1024],
          "dtype": "float32",
          "name": "bidirectional_6/forward_bilstm_1/lstm_cell_20/kernel"
        },
        {
          "shape": [256, 1024],
          "dtype": "float32",
          "name": "bidirectional_6/forward_bilstm_1/lstm_cell_20/recurrent_kernel"
        },
        {
          "shape": [1024],
          "dtype": "float32",
          "name": "bidirectional_6/forward_bilstm_1/lstm_cell_20/bias"
        },
        {
          "shape": [100, 1024],
          "dtype": "float32",
          "name": "bidirectional_6/backward_bilstm_1/lstm_cell_21/kernel"
        },
        {
          "shape": [256, 1024],
          "dtype": "float32",
          "name": "bidirectional_6/backward_bilstm_1/lstm_cell_21/recurrent_kernel"
        },
        {
          "shape": [1024],
          "dtype": "float32",
          "name": "bidirectional_6/backward_bilstm_1/lstm_cell_21/bias"
        },
        {
          "shape": [512, 512],
          "dtype": "float32",
          "name": "bidirectional_7/forward_bilstm_2/lstm_cell_23/kernel"
        },
        {
          "shape": [128, 512],
          "dtype": "float32",
          "name": "bidirectional_7/forward_bilstm_2/lstm_cell_23/recurrent_kernel"
        },
        {
          "shape": [512],
          "dtype": "float32",
          "name": "bidirectional_7/forward_bilstm_2/lstm_cell_23/bias"
        },
        {
          "shape": [512, 512],
          "dtype": "float32",
          "name": "bidirectional_7/backward_bilstm_2/lstm_cell_24/kernel"
        },
        {
          "shape": [128, 512],
          "dtype": "float32",
          "name": "bidirectional_7/backward_bilstm_2/lstm_cell_24/recurrent_kernel"
        },
        {
          "shape": [512],
          "dtype": "float32",
          "name": "bidirectional_7/backward_bilstm_2/lstm_cell_24/bias"
        },
        {
          "shape": [256, 12],
          "dtype": "float32",
          "name": "lstm_out/lstm_cell_25/kernel"
        },
        {
          "shape": [3, 12],
          "dtype": "float32",
          "name": "lstm_out/lstm_cell_25/recurrent_kernel"
        },
        {
          "shape": [12],
          "dtype": "float32",
          "name": "lstm_out/lstm_cell_25/bias"
        }
      ],
      "paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"]
    }
  ],
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.3.0"
}
