{"modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "training_config": {"loss_weights": null, "metrics": ["mean_squared_error"], "loss": "mean_squared_error", "optimizer_config": {"config": {"decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "learning_rate": 0.0007842721533961594, "name": "Adam"}, "class_name": "Adam"}, "weighted_metrics": null}, "model_config": {"config": {"layers": [{"config": {"sparse": false, "name": "dense_2_input", "ragged": false, "batch_input_shape": [null, 2], "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 2500, "batch_input_shape": [null, 2], "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 2000, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 200, "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"dtype": "float32", "target_shape": [100, 2], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape"}], "name": "sequential_1"}, "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"dtype": "float32", "shape": [2, 2500], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [2500], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [2500, 2000], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [2000], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [2000, 200], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [200], "name": "dense_4/bias"}]}], "generatedBy": "keras v2.4.0", "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0"}