{"convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"backend": "tensorflow", "keras_version": "2.4.0", "training_config": {"loss": "mean_squared_error", "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "decay": 0.0, "clipvalue": 1, "learning_rate": 0.0001448976108804345, "epsilon": 1e-07, "amsgrad": false, "name": "Adam", "beta_2": 0.9990000128746033}}, "metrics": ["mean_squared_error"], "loss_weights": null}, "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "InputLayer", "config": {"name": "dense_6_input", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 2], "ragged": false}}, {"class_name": "Dense", "config": {"units": 1000, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "batch_input_shape": [null, 2], "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "name": "dense_6", "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}}}, {"class_name": "Dense", "config": {"units": 400, "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_7", "trainable": true}}, {"class_name": "Dense", "config": {"units": 300, "dtype": "float32", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_8", "trainable": true}}, {"class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_6", "trainable": true, "target_shape": [100, 3]}}, {"class_name": "LSTM", "config": {"unroll": false, "units": 300, "stateful": false, "use_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "return_sequences": false, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "name": "lstm_4", "batch_input_shape": [null, 100, 3], "activation": "tanh", "recurrent_dropout": 0.0, "implementation": 2, "return_state": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "time_major": false, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_7", "trainable": true, "target_shape": [100, 3]}}, {"class_name": "LSTM", "config": {"unroll": false, "units": 300, "stateful": false, "use_bias": true, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "return_sequences": false, "kernel_regularizer": null, "recurrent_activation": "sigmoid", "name": "lstm_5", "batch_input_shape": [null, 100, 3], "activation": "tanh", "recurrent_dropout": 0.0, "implementation": 2, "return_state": false, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "time_major": false, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "recurrent_regularizer": null, "unit_forget_bias": true}}, {"class_name": "Reshape", "config": {"dtype": "float32", "name": "reshape_8", "trainable": true, "target_shape": [100, 3]}}], "name": "sequential_2"}}}, "generatedBy": "keras v2.4.0", "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "dense_6/kernel", "dtype": "float32", "shape": [2, 1000]}, {"name": "dense_6/bias", "dtype": "float32", "shape": [1000]}, {"name": "dense_7/kernel", "dtype": "float32", "shape": [1000, 400]}, {"name": "dense_7/bias", "dtype": "float32", "shape": [400]}, {"name": "dense_8/kernel", "dtype": "float32", "shape": [400, 300]}, {"name": "dense_8/bias", "dtype": "float32", "shape": [300]}, {"name": "lstm_4/lstm_cell_4/kernel", "dtype": "float32", "shape": [3, 1200]}, {"name": "lstm_4/lstm_cell_4/recurrent_kernel", "dtype": "float32", "shape": [300, 1200]}, {"name": "lstm_4/lstm_cell_4/bias", "dtype": "float32", "shape": [1200]}, {"name": "lstm_5/lstm_cell_5/kernel", "dtype": "float32", "shape": [3, 1200]}, {"name": "lstm_5/lstm_cell_5/recurrent_kernel", "dtype": "float32", "shape": [300, 1200]}, {"name": "lstm_5/lstm_cell_5/bias", "dtype": "float32", "shape": [1200]}]}], "format": "layers-model"}