{"weightsManifest": [{"weights": [{"shape": [2, 800], "name": "dense_23/kernel", "dtype": "float32"}, {"shape": [800], "name": "dense_23/bias", "dtype": "float32"}, {"shape": [800, 400], "name": "dense_24/kernel", "dtype": "float32"}, {"shape": [400], "name": "dense_24/bias", "dtype": "float32"}, {"shape": [400, 300], "name": "dense_25/kernel", "dtype": "float32"}, {"shape": [300], "name": "dense_25/bias", "dtype": "float32"}, {"shape": [300, 300], "name": "dense_26/kernel", "dtype": "float32"}, {"shape": [300], "name": "dense_26/bias", "dtype": "float32"}, {"shape": [3, 2000], "name": "lstm_18/lstm_cell/kernel", "dtype": "float32"}, {"shape": [500, 2000], "name": "lstm_18/lstm_cell/recurrent_kernel", "dtype": "float32"}, {"shape": [2000], "name": "lstm_18/lstm_cell/bias", "dtype": "float32"}, {"shape": [500, 1200], "name": "lstm_19/lstm_cell_1/kernel", "dtype": "float32"}, {"shape": [300, 1200], "name": "lstm_19/lstm_cell_1/recurrent_kernel", "dtype": "float32"}, {"shape": [1200], "name": "lstm_19/lstm_cell_1/bias", "dtype": "float32"}, {"shape": [300, 1200], "name": "lstm_20/lstm_cell_2/kernel", "dtype": "float32"}, {"shape": [300, 1200], "name": "lstm_20/lstm_cell_2/recurrent_kernel", "dtype": "float32"}, {"shape": [1200], "name": "lstm_20/lstm_cell_2/bias", "dtype": "float32"}, {"shape": [300, 1200], "name": "lstm_21/lstm_cell_3/kernel", "dtype": "float32"}, {"shape": [300, 1200], "name": "lstm_21/lstm_cell_3/recurrent_kernel", "dtype": "float32"}, {"shape": [1200], "name": "lstm_21/lstm_cell_3/bias", "dtype": "float32"}], "paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"]}], "format": "layers-model", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"training_config": {"weighted_metrics": null, "loss": "mean_squared_error", "metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.172865975415334e-05, "clipvalue": 1, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "amsgrad": false}}}, "keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"layers": [{"class_name": "InputLayer", "config": {"name": "input_6", "dtype": "float32", "ragged": false, "sparse": false, "batch_input_shape": [null, 2]}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 800, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "name": "dense_23", "kernel_constraint": null}, "name": "dense_23", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 400, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "dtype": "float32", "trainable": true, "name": "dense_24", "kernel_constraint": null}, "name": "dense_24", "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "dtype": "float32", "trainable": true, "name": "dense_25", "kernel_constraint": null}, "name": "dense_25", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "name": "reshape_8", "target_shape": [100, 3], "dtype": "float32"}, "name": "reshape_8", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "unroll": false, "batch_input_shape": [null, 100, 3], "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "time_major": false, "activity_regularizer": null, "units": 500, "trainable": true, "go_backwards": false, "kernel_constraint": null, "implementation": 2, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "unit_forget_bias": true, "dtype": "float32", "name": "lstm_18", "stateful": false, "dropout": 0.0, "activation": "tanh"}, "name": "lstm_18", "inbound_nodes": [[["reshape_8", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "unroll": false, "batch_input_shape": [null, 100, 3], "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "time_major": false, "activity_regularizer": null, "units": 300, "trainable": true, "go_backwards": false, "kernel_constraint": null, "implementation": 2, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "unit_forget_bias": true, "dtype": "float32", "name": "lstm_19", "stateful": false, "dropout": 0.0, "activation": "tanh"}, "name": "lstm_19", "inbound_nodes": [[["lstm_18", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "unroll": false, "batch_input_shape": [null, 100, 3], "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "time_major": false, "activity_regularizer": null, "units": 300, "trainable": true, "go_backwards": false, "kernel_constraint": null, "implementation": 2, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "unit_forget_bias": true, "dtype": "float32", "name": "lstm_20", "stateful": false, "dropout": 0.0, "activation": "tanh"}, "name": "lstm_20", "inbound_nodes": [[["lstm_19", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_dropout": 0.0, "recurrent_activation": "sigmoid", "unroll": false, "batch_input_shape": [null, 100, 3], "bias_constraint": null, "recurrent_constraint": null, "use_bias": true, "time_major": false, "activity_regularizer": null, "units": 300, "trainable": true, "go_backwards": false, "kernel_constraint": null, "implementation": 2, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "unit_forget_bias": true, "dtype": "float32", "name": "lstm_21", "stateful": false, "dropout": 0.0, "activation": "tanh"}, "name": "lstm_21", "inbound_nodes": [[["lstm_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "linear", "activity_regularizer": null, "dtype": "float32", "trainable": true, "name": "dense_26", "kernel_constraint": null}, "name": "dense_26", "inbound_nodes": [[["lstm_21", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"trainable": true, "name": "path_out", "target_shape": [100, 3], "dtype": "float32"}, "name": "path_out", "inbound_nodes": [[["dense_26", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "name": "functional_11", "output_layers": [["path_out", 0, 0]]}}}, "generatedBy": "keras v2.4.0"}